tutorials/Example_Applications/Coastal_Barrier/Coastal_well/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    top
    {
        // type            pressureInletOutletVelocity;
        // value           uniform (0 0 0);
        type zeroGradient;
    }

    sidewalls
    {
        type            noSlip;
        // type            fixedValue; //zeroGradient;
    	// value		uniform (0 0 0);
    }
    
    bottom
    {
        // type            fixedValue;
        // value           uniform (0 0 0);
        type zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
