tutorials/Example_Applications/Coastal_Barrier/Coastal_well/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    sidewalls
    {
        // type            zeroGradient;
        type            fixedFluxPressure; //zeroGradient;
    }

    bottom
    {
        type            fixedFluxPressure;
    }
    top
    {
        //type            totalPressure;
        //p0              uniform 0;
        type fixedValue;
        value uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
